tutorials/cfdemSolverPiso/bubblingFluidizedBed/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall
    {
        type            slip;
    }

    inlet
    {
        type            uniformFixedValue;
        uniformValue    table
        (
            (0.000 (0 0 0.0066))
            (0.100 (0 0 0.6600)) // 2x minimum fluidization velocity
        );
    }

    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
